application/modules/Custom/Interbrain/Perfect2/requestA.xml

<?xml version="1.0" encoding="UTF-8"?> 
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
    xmlns:ns1="http://interbrain.p2online/" xmlns:ns2="http://xml.apache.org/xml-soap">
    <env:Body>
        <ns1:ValidateOrder/>
        <param1>
            <item>
                <key>Items</key>
                <value>
                    <ns2:Map>
                        <item>
                            <key>Id</key>
                            <value>1</value>
                        </item>
                        <item>
                            <key>Client</key>
                            <value>
                                <item>
                                    <key>Typ</key>
                                    <value>2</value>
                                </item>
                                <item>
                                    <key>EMailAddress</key>
                                    <value>a.kummer@wdrei.ch</value>
                                </item>
                            </value>
                        </item>
                        <item>
                            <key>ItemID</key>
                            <value>GU00000000010000000002</value>
                        </item>
                        <item>
                            <key>ItemLanguage</key>
                            <value>SD</value>
                        </item>
                        <item>
                            <key>Quantity</key>
                            <value>1</value>
                        </item>
                    </ns2:Map>
                    <ns2:Map>
                        <item>
                            <key>Id</key>
                            <value>1</value>
                        </item>
                        <item>
                            <key>Client</key>
                            <value>
                                <item>
                                    <key>Typ</key>
                                    <value>2</value>
                                </item>
                                <item>
                                    <key>EMailAddress</key>
                                    <value>a.kummer@wdrei.ch</value>
                                </item>
                            </value>
                        </item>
                        <item>
                            <key>ItemID</key>
                            <value>GU00000000010000000003</value>
                        </item>
                        <item>
                            <key>ItemLanguage</key>
                            <value>SD</value>
                        </item>
                        <item>
                            <key>Quantity</key>
                            <value>1</value>
                        </item>
                    </ns2:Map>
                </value>
            </item>
        </param1>
    </env:Body>
</env:Envelope>
